#--------------------------------------------------------------
# 내장함수 map(함수명, 여러개 데이터) #교재 264p
#--------------------------------------------------------------
# data=input('숫자 데이터 입력 : ')
# print(type(data),data)

#1개 문자열 => 여러개 문자열 분리
#예) '10 20 30' => '10','20','30'
# nums=data.split()

# result=map(int, nums)
# print(type(result),result)

# myfunc=int
# result2=map(myfunc, nums)
# print(type(result2),result2)
# print(id(int),id(myfunc))

#--------------------------------------------------------------
# 형변환 =>
# *자동/묵시적 형변환 : 컴퓨터가 진행, 작은 것 => 큰 것
# *수동/명시적 형변환 : 개발자가 진행, 큰 것 => 작은 것
#--------------------------------------------------------------
a=10
b=3
print(a/b) #변수가 정수지만 실수로 변환하여 연산. 자동 형변환의 예