#201. "비트코인" 문자열을 화면에 출력하는 print_coin() 함수를 정의하라.
def print_coin():
    print("비트코인")

#202. 201번에서 정의한 함수를 호출하라.
print_coin()

#203. 201번에서 정의한 print_coin 함수를 100번호출하라.
# for c in range(100):
#     print_coin()

#204. "비트코인" 문자열을 100번 화면에 출력하는 print_coins() 함수를 정의하라.
# def print_coins():
#     for c in range(100):
#         print("비트코인")

#205. hello()
# def hello():
#     print("Hi")
# 함수 정의를 하기도 전에 호출함

#206. 206 아래 코드의 실행 결과를 예측하라.
#출력 예상: 사용자 함수 message()를 호출해서 "A""B"가 줄바꿈으로 출력됨 이후 print("C")가 작동
# 이후에는 다시 사용자 함수 message()가 호출되어 "A""B"가 줄바꿈으로 출력

#207. 아래 코드의 실행 결과를 예측하라.
#출력 예상 : print("A") 가 먼저 작동, 그 다음은 사용자 함수 message()가 정의 되었고 아래의 print("C")가 실행
# 마지막으로 사용자 정의 함수 message()가 호출되어 실행, "B"가 출력된다.
# "A" "C" "B"순으로 줄바꿈되어 출력

#208. 아래 코드의 실행 결과를 예측하라.
# "A","C","B","E","D" 순으로 줄바꿈 되어 출력

#209. 아래 코드의 실행 결과를 예측하라. 사용자 함수 안의 사용자 함수
# "B","A" 순으로 줄바꿈 되어 출력

#210. 아래 코드의 실행 결과를 예측하라. 사용자 함수 안의 사용자 함수
#"B","C","B","C","B","C","A"

#211. 함수의 호출 결과를 예측하라.
#출력 예상 : "안녕" "Hi" 다른 줄에 출력

#212